#include "../lib/students.h"
#include "../lib/students2.h"

#include <vector>

int main() {

//      reyting = (Modeluvanna_ta_identificatia_obyectiv_upr + Obrpbka_sugnaliv +
//                Proyectuvanna_prustroiv_system_uprl + AVP1 +
//                Progr_ta_nalagodzhenna_controllerov1 + Proyectuvanna_system_avtomatuku +
//                AVP2 + Komp_merezhi + Localny_sustemu +
//                Progr_ta_nalagodzhenna_controllerov2) / 10.0f;
// }

    std::vector<Students> students = {
        //AT-211

        Students("Антонішин Євгеній Васильович", 0, 75,	90,	95,	100,	90,	95,	100,	100,	100),
        Students("Антонов Владислав Євгенович", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
        Students("Артюх Михайло Вадимович", 0, 60,	75,	60, 60,	75,	60,	60,	60,	60),
        Students("Богаченко Максим Георгійович", 75, 60,	90,	95,	100,	90,	90,	100,	100,	100 ),
        Students("Божко Артем Олегович", 0, 60,	90,	60,	60,	90,	60,	60,	60,	60),
        Students("Васильковский Роман Павлович",0,  85,	95, 0, 0, 95,	75, 0, 0, 0 ),
        Students("Георгієв Олександр Валерійович", 0, 60,	80,	0, 0, 80, 0, 0, 0, 0 ),
        Students("Горайчук Костянтин Володимирович", 0, 60,	60,	60,	60,	60,	60, 0,	60,	60 ),
        Students("Золкін Андрій Володимирович",  0, 60,	60,	60,	60,	60,	60, 0,	60,	60 ),
        Students("Іщенко Євгеній Олександрович",  0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ),
        Students("Квапіш Олександр Олександрович",0,  85,	75,	60,	85,	75,	60,	60,	85,	85),
        Students("Козак Олег Серійович",   0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ),
        Students("Колесник Костянтин Сергійович",   0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
        Students("Марченко Павло Сергійович",   0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ),
        Students("Наумов Максим Вадимович", 95,	95,	100,	100,	100,	100,	100,	100,	100,	100 ),
        Students("Ніколаєв Микола Сергійович",   0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ),
        Students("Пащенко Владислав Олександрович", 0, 60,	75,	75,	60,	75,	70,	0,	60,	60),
        Students("Романюк Іван Дмитрович", 100,	85,	90,	95,	100,	90,	90,	100,	100,	100),
        Students("Свірідов Ілья Олександрович",0, 60,	100,	95,	100,	100,	90,	0,	100,	100 ),
        Students("Табаков Данило Олександрович",0, 0, 90,	75,	100,	90,	80, 0,		100,	100 ),
        Students("Циган Денис Вячеславович", 95,	90,	100,	95,	90,	100,	95,	100,	90,	90),
        Students("Шаріпов Андрій Олександрович", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ),
    };

     std::vector<Students2> students2 = {
        //AT-212
        Students2("Божко Данило Ростиславович", 0, 0, 0, 0, 0, 0, 0, 0, 0 ),
        Students2("Виходець Роман Сергійович",60,	0,	85,	60,	85,	65,	61,	75,	75 ),
        Students2("Ганган Артемій Андрійович", 0, 0, 0, 0, 0, 0, 0, 0, 0 ),
        Students2("Дадаян Юрій",0, 60,0,		60, 0, 		60, 0,0,0 ),
        Students2("Данилюк Даниїл Юрійович", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ),
        Students2("Івашкевич Антон Ілліч",0, 0, 90,	75,	0,	60, 0,0,0),
        Students2("Караман Ростислав Костянтинович",75,	60,	100,	90,	100,	90,	63,	100,	100),
        Students2("Колеснік Роман Васильович", 0, 0, 0, 0, 0, 65, 0, 0, 0),
        Students2("Лазаренко Ярослав Ігорович",100,	95,	100,	100,	100,	100,	100,	100,	100),
        Students2("Луковець Антон Васильович", 0, 60,	75,	60,	60,	60,	60,	60,	60),
        Students2("Мукомол Джонатан Ігорович", 0, 60,	60,	60,	60, 0, 0, 0, 0, 0 ),
        Students2("Погорельська Олександра Григорівна", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 ),
        Students2("Протас Андрій Вікторович", 0, 0, 75, 0, 0, 0, 0, 0, 0, 0 ),
        Students2("Семенків Богдан Сергійович", 0, 60,	90,	90,	60,	90, 0, 60, 60 ),
        Students2("Семенов Єгор Юрійович", 100,	95,	100,	100,	100,	100,	100,	100,	100),
        Students2("Тесля Олександр Ростиславович", 60, 0, 80, 0, 0, 0, 0, 0, 0),
        Students2("Шукалович Іван Вікторович", 0, 0, 0, 0, 0, 0, 0, 0, 0)
    };
   

    for (auto& student : students) {
        student.calculateRating();
    }
    for (auto& student : students2) {
        student.calculateRating();
    }

    printf("-----AT-211-----");
    Students::sortAndDisplay(Students);

    printf("-----AT-212-----");
    Students2::sortAndDisplay(students2);



    return 0;
}
